[
    {
        "biography": "I built this app!\n\n",
        "following": [
            "bm123",
            "fl123",
            "sm123"
        ],
        "ignoring": [
            [
                "jk123"
            ]
        ],
        "location": "Los Angeles",
        "password": "jr11",
        "posts_in_timeline": 3,
        "user_id": "jr123",
        "username": "Jordan00"
    },
    {
        "biography": "Batman is a fictional superhero appearing in American comic books published by DC Comics. The character was created by artist Bob Kane and writer Bill Finger, and first appeared in Detective Comics #27, in 1939. Originally named the 'Bat-Man', the character is also referred to by such epithets as the Caped Crusader, the Dark Knight, and the World's Greatest Detective.\n\nBatman's secret identity is Bruce Wayne, a wealthy American playboy, philanthropist, and owner of Wayne Enterprises. After witnessing the murder of his parents Dr. Thomas Wayne and Martha Wayne as a child, he swore vengeance against criminals, an oath tempered by a sense of justice. Bruce Wayne trains himself physically and intellectually and crafts a bat-inspired persona to fight crime.\n\n",
        "following": [
            "jr123",
            "rb123",
            "jk123",
            "fl123",
            "sm123"
        ],
        "ignoring": [],
        "location": "Gotham",
        "password": "bw11",
        "posts_in_timeline": 6,
        "user_id": "bm123",
        "username": "batman"
    },
    {
        "biography": "Robin is the name of several fictional superheroes appearing in American comic books published by DC Comics. The character was originally created by Bob Kane, Bill Finger, and Jerry Robinson, to serve as a junior counterpart to the superhero Batman. The character's first incarnation, Dick Grayson, debuted in Detective Comics #38 (April 1940). Conceived as a way to attract young readership, Robin garnered overwhelmingly positive critical reception, doubling the sales of the Batman titles. The early adventures of Robin included Star Spangled Comics #65–130 (1947–1952), which was the character's first solo feature. Robin made regular appearances in Batman related comic books and other DC Comics publications from 1940 through the early 1980s until the character set aside the Robin identity and became the independent superhero Nightwing. The team of Batman and Robin has commonly been referred to as the Caped Crusaders or Dynamic Duo.\n\n",
        "following": [
            "bm123"
        ],
        "ignoring": [
            "jr123"
        ],
        "location": "Bludhaven",
        "password": "dg11",
        "posts_in_timeline": 6,
        "user_id": "rb123",
        "username": "robin"
    },
    {
        "biography": "Superman is a fictional superhero created by writer Jerry Siegel and artist Joe Shuster. He first appeared in Action Comics #1, a comic book published on April 18, 1938. He appears regularly in American comic books published by DC Comics, and has been adapted to radio shows, newspaper strips, television shows, movies, and video games.\n\nSuperman was born on the planet Krypton, and as a baby named Kal-El, was sent to Earth in a small spaceship by his scientist father Jor-El, moments before Krypton was destroyed in a natural cataclysm. His ship landed in the American countryside, where he was discovered and adopted by Jonathan and Martha Kent, a farming couple. They named him Clark. Clark displayed various superhuman abilities such as incredible strength and impervious skin, and his foster parents advised him to use his gifts for the benefit of humanity. Clark Kent resides in the fictional American city of Metropolis, where he works as a journalist for the Daily Planet, a newspaper. To protect his privacy, he changes into a colorful costume and uses the alias 'Superman' when fighting crime. Superman's love interest is his fellow journalist Lois Lane, and his classic archenemy is the genius inventor Lex Luthor. He is a friend of many other superheroes in the DC Universe, such as Batman and Wonder Woman.\n\n",
        "following": [
            "jr123",
            "fl123"
        ],
        "ignoring": [
            "bm123"
        ],
        "location": "Metropolis",
        "password": "ck11",
        "posts_in_timeline": 6,
        "user_id": "sm123",
        "username": "superman"
    },
    {
        "biography": "The Joker is a fictional supervillain created by Bill Finger, Bob Kane, and Jerry Robinson who first appeared in the debut issue of the comic book Batman (April 25, 1940), published by DC Comics. Credit for the Joker's creation is disputed; Kane and Robinson claimed responsibility for the Joker's design, while acknowledging Finger's writing contribution. Although the Joker was planned to be killed off during his initial appearance, he was spared by editorial intervention, allowing the character to endure as the archenemy of the superhero Batman.\n\nIn his comic book appearances, the Joker is portrayed as a criminal mastermind. Introduced as a psychopath with a warped, sadistic sense of humor, the character became a goofy prankster in the late 1950s in response to regulation by the Comics Code Authority, before returning to his darker roots during the early 1970s. As Batman's nemesis, the Joker has been part of the superhero's defining stories, including the murder of Jason Todd—the second Robin and Batman's ward—and the paralysis of one of Batman's allies, Barbara Gordon. The Joker has had various possible origin stories during his decades of appearances. The most common story involves him falling into a tank of chemical waste which bleaches his skin white and turns his hair green and lips bright red; the resulting disfigurement drives him insane. The antithesis of Batman in personality and appearance, the Joker is considered by critics to be his perfect adversary.\n\n",
        "following": [
            "bm123"
        ],
        "ignoring": [
            "jr123",
            "bm123",
            "rb123",
            "sm123",
            "fl123"
        ],
        "location": "Arkham Asylum",
        "password": "jv11",
        "posts_in_timeline": 6,
        "user_id": "jk123",
        "username": "joker"
    },
    {
        "biography": "The Flash (or simply Flash) is the name of several superheroes appearing in comic books published by DC Comics. Created by writer Gardner Fox and artist Harry Lampert, the original Flash first appeared in Flash Comics #1 (cover date January 1940/release month November 1939). Nicknamed the 'Scarlet Speedster', all incarnations of the Flash possess 'super speed', which includes the ability to run, move, and think extremely fast, use superhuman reflexes, and seemingly violate certain laws of physics.\n\nThus far, at least four different characters—each of whom somehow gained the power of 'the speed force'—have assumed the mantle of the Flash in DC's history: college athlete Jay Garrick (1940–1951, 1961–2011, 2017–present), forensic scientist Barry Allen (1956–1985, 2008–present), Barry's nephew Wally West (1986–2011, 2016–present), and Barry's grandson Bart Allen (2006–2007). Each incarnation of the Flash has been a key member of at least one of DC's premier teams: the Justice Society of America, the Justice League, and the Teen Titans.\n\n",
        "following": [
            "bm123",
            "rb123",
            "sm123"
        ],
        "ignoring": [],
        "location": "Central City",
        "password": "ba11",
        "posts_in_timeline": 6,
        "user_id": "fl123",
        "username": "flash"
    }
]